ares.standard/src/test/resources/getDtoResponseByIco/ico=bad_input.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header>
        <eps:endpoints xmlns:eps="http://schemas.biztalk.org/btf-2-0/endpoints" SOAP-ENV:mustUnderstand="0" Id="idEndpoints">
            <eps:to>
                <eps:address></eps:address>
            </eps:to>
            <eps:from>
                <eps:address>ARES, Ministerstvo financí</eps:address>
            </eps:from>
        </eps:endpoints>
        <prop:properties xmlns:prop="http://schemas.biztalk.org/btf-2-0/properties" SOAP-ENV:mustUnderstand="0" Id="idProperties">
            <prop:identity>210423100052_15217V</prop:identity>
            <prop:sentAt>2021-04-23T08:00:52</prop:sentAt>
            <prop:expiresAt>2021-04-23T09:00:52</prop:expiresAt>
            <prop:topic>http://wwwinfo.mfcr.cz/ares/xml_doc/schemas/ares/ares_answer/v_1.0.1</prop:topic>
        </prop:properties>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body Id="idBody">
        <are:Ares_odpovedi xmlns:are="http://wwwinfo.mfcr.cz/ares/xml_doc/schemas/ares/ares_answer/v_1.0.1" xmlns:dtt="http://wwwinfo.mfcr.cz/ares/xml_doc/schemas/ares/ares_datatypes/v_1.0.4" xmlns:udt="http://wwwinfo.mfcr.cz/ares/xml_doc/schemas/uvis_datatypes/v_1.0.1" odpoved_datum_cas="2021-04-23T10:00:52" odpoved_pocet="1" odpoved_typ="Standard" vystup_format="XML" validation_XSLT="http://wwwinfo.mfcr.cz/ares/xml_doc/schemas/ares/ares_answer/v_1.0.0/ares_answer.xsl" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://wwwinfo.mfcr.cz/ares/xml_doc/schemas/ares/ares_answer/v_1.0.1 http://wwwinfo.mfcr.cz/ares/xml_doc/schemas/ares/ares_answer/v_1.0.1/ares_answer_v_1.0.1.xsd" Id="Ares_odpoved">
            <are:Odpoved>
                <are:Pomocne_ID>1</are:Pomocne_ID>
                <are:Error>
                    <dtt:Error_kod>7</dtt:Error_kod>
                    <dtt:Error_text>chyba logických vazeb vstupních dat v dotazu - POZOR! Hrozí zablokování Vaší IP adresy! Prosím čtěte http://wwwinfo.mfcr.cz/ares/ares_xml_standard.html.cz#max</dtt:Error_text>
                </are:Error>
                <are:Error>
                    <dtt:Error_kod>7</dtt:Error_kod>
                    <dtt:Error_text>chyba logických vazeb vstupních dat v dotazu - POZOR! Hrozí zablokování Vaší IP adresy! Prosím čtěte http://wwwinfo.mfcr.cz/ares/ares_xml_standard.html.cz#max</dtt:Error_text>
                </are:Error>
                <are:Error>
                    <dtt:Error_kod>7</dtt:Error_kod>
                    <dtt:Error_text>chyba logických vazeb vstupních dat v dotazu - POZOR! Hrozí zablokování Vaší IP adresy! Prosím čtěte http://wwwinfo.mfcr.cz/ares/ares_xml_standard.html.cz#max</dtt:Error_text>
                </are:Error>
                <are:Pocet_zaznamu>0</are:Pocet_zaznamu>
                <are:Typ_vyhledani>FREE</are:Typ_vyhledani>
            </are:Odpoved>
        </are:Ares_odpovedi>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>